{
  "Internal Medicine": [
    "Who should I see for frequent fatigue and body aches?",
    "Which doctor can help me with frequent headaches and dizziness?",
    "Who can diagnose the cause of my fluctuating blood pressure?",
    "Which specialist should I visit for unexplained weight loss?",
    "Who can help me manage my prediabetes?"
  ],
  "Cardiologist": [
    "Which doctor should I see for chest pain while walking?",
    "Who can diagnose the cause of my rapid heartbeat?",
    "Which specialist can help me manage high blood pressure?",
    "Who should I see for shortness of breath during exercise?",
    "Which doctor can check if I have a heart problem?"
  ],
  "Endocrinologist": [
    "Who should I visit for sudden weight gain and fatigue?",
    "Which doctor can check if I have a thyroid problem?",
    "Who specializes in diabetes management?",
    "Which doctor should I see for hormonal imbalances?",
    "Who can diagnose the cause of my excessive thirst and frequent urination?"
  ],
  "Gastroenterologist": [
    "Who should I see for frequent bloating and stomach pain?",
    "Which doctor can help me with acid reflux?",
    "Who can diagnose the cause of my frequent diarrhea?",
    "Which specialist can help with unexplained nausea after eating?",
    "Who should I see for black or bloody stools?"
  ],
  "Hematologist": [
    "Who can diagnose the cause of my frequent nosebleeds?",
    "Which doctor should I see for anemia treatment?",
    "Who can help me understand my abnormal blood test results?",
    "Which specialist treats clotting disorders?",
    "Who should I see for chronic fatigue and pale skin?"
  ],
  "Nephrologist": [
    "Who should I see for frequent kidney infections?",
    "Which doctor specializes in treating kidney disease?",
    "Who can help me manage high creatinine levels?",
    "Which specialist can diagnose the cause of my swollen ankles?",
    "Who should I visit for concerns about my urine test results?"
  ],
  "Neurologist": [
    "Which doctor should I see for frequent migraines?",
    "Who specializes in diagnosing nerve pain and tingling?",
    "Who can check if I have a neurological disorder?",
    "Which specialist can help me with sudden dizziness and balance issues?",
    "Who should I visit for memory loss and confusion?"
  ],
  "Oncologist": [
    "Who should I see if I found a lump on my body?",
    "Which doctor specializes in cancer treatment?",
    "Who can help me understand my biopsy results?",
    "Which specialist can diagnose and treat leukemia?",
    "Who should I visit if I have unexplained weight loss and night sweats?"
  ],
  "Pulmonologist": [
    "Who should I see for a chronic cough that won’t go away?",
    "Which doctor can help me manage asthma symptoms?",
    "Who specializes in diagnosing lung diseases?",
    "Which specialist should I visit for shortness of breath even at rest?",
    "Who can help me if I wake up gasping for air at night?"
  ],
  "Rheumatologist": [
    "Who specializes in treating joint pain and stiffness?",
    "Which doctor can diagnose autoimmune diseases?",
    "Who should I see for chronic back pain that doesn’t go away?",
    "Which specialist can help with swelling in multiple joints?",
    "Who should I visit for persistent muscle pain and fatigue?"
  ],
  "Infectious Disease Specialist": [
    "Who should I see for recurring infections?",
    "Which doctor specializes in treating tuberculosis?",
    "Who can diagnose the cause of my prolonged fever?",
    "Which specialist should I visit for HIV or other viral infections?",
    "Who can help with travel-related illnesses?"
  ],
  "Geriatrician": [
    "Who specializes in elderly healthcare?",
    "Which doctor can help with memory loss in seniors?",
    "Who should I see for frequent falls and balance issues?",
    "Which specialist can help manage multiple chronic conditions in older adults?",
    "Who can provide care for age-related hearing loss and vision changes?"
  ],
  "General Surgeon": [
    "Who should I see for a hernia that needs surgery?",
    "Which doctor performs gallbladder removal?",
    "Who specializes in surgical treatment of appendicitis?",
    "Which surgeon can remove a cyst or lump?",
    "Who should I see for a non-healing wound that may require surgery?"
  ],
  "Cardiothoracic Surgeon": [
    "Who performs heart bypass surgery?",
    "Which doctor should I see for a heart valve replacement?",
    "Who specializes in lung surgery?",
    "Which surgeon can perform a heart transplant?",
    "Who should I visit for coronary artery disease that needs surgery?"
  ],
  "Neurosurgeon": [
    "Who should I see for a herniated disc that may need surgery?",
    "Which doctor performs brain tumor surgery?",
    "Who specializes in treating spinal cord injuries?",
    "Which surgeon can help with chronic nerve pain?",
    "Who should I visit for hydrocephalus that needs surgical treatment?"
  ],
  "Orthopedic Surgeon": [
    "Who specializes in treating bone fractures?",
    "Which doctor can perform knee replacement surgery?",
    "Who should I see for a torn ligament?",
    "Which specialist can treat a shoulder dislocation?",
    "Who performs surgeries for spinal deformities?"
  ],
  "Plastic Surgeon": [
    "Who should I see for reconstructive surgery after an accident?",
    "Which doctor specializes in cosmetic surgery?",
    "Who can perform a breast reduction for medical reasons?",
    "Which surgeon can help with burn scars?",
    "Who should I visit for facial reconstructive surgery?"
  ],
  "Ophthalmologist": [
    "Who should I see for blurry vision that glasses don’t fix?",
    "Which doctor treats cataracts?",
    "Who specializes in diagnosing and treating glaucoma?",
    "Which specialist can perform LASIK surgery?",
    "Who should I see for frequent eye infections?"
  ],
  "Otolaryngologist (ENT Specialist)": [
    "Who should I see for chronic sinus infections?",
    "Which doctor treats ear pain and hearing loss?",
    "Who specializes in treating throat infections?",
    "Which specialist can diagnose and treat dizziness and vertigo?",
    "Who should I visit for voice hoarseness that won’t go away?"
  ],
  "Urologist": [
    "Who specializes in treating kidney stones?",
    "Which doctor can diagnose and treat prostate problems?",
    "Who should I see for frequent urinary tract infections?",
    "Which specialist can help with male infertility?",
    "Who can diagnose the cause of blood in my urine?"
  ],
  "Dermatologist": [
    "Who should I see for persistent skin rashes?",
    "Which doctor can help with acne that won’t go away?",
    "Who specializes in diagnosing suspicious moles?",
    "Which specialist can treat hair loss?",
    "Who should I visit for a fungal infection on my nails?"
  ],
  "Allergist": [
    "Who specializes in treating seasonal allergies?",
    "Which doctor should I see for frequent allergic reactions?",
    "Who can diagnose and treat food allergies?",
    "Which specialist can help with chronic hives?",
    "Who should I see for a dust mite allergy?"
  ],
  "Psychiatrist": [
    "Who specializes in treating severe anxiety and depression?",
    "Which doctor can diagnose and manage bipolar disorder?",
    "Who should I see for frequent panic attacks?",
    "Which specialist can help with PTSD?",
    "Who can prescribe medication for ADHD?"
  ],
  "Pain Management Specialist": [
    "Who should I see for chronic pain in my lower back?",
    "Which doctor specializes in treating nerve pain?",
    "Who can help manage arthritis pain?",
    "Which specialist can treat post-surgical pain?",
    "Who should I visit for pain caused by a slipped disc?"
  ]
}

